export const numbersData = Array.from({ length: 101 }, (_, i) => {
  const tens = ["", "", "Жыйырма", "Отуз", "Кырк", "Элүү", "Алтымыш", "Жетимиш", "Сексен", "Токсон"];
  const ones = ["", "Бир", "Эки", "Үч", "Төрт", "Беш", "Алты", "Жети", "Сегиз", "Тогуз"];
  let kg = "";

  if (i <= 20) {
    const kgMap = [
      "Нөл","Бир","Эки","Үч","Төрт","Беш","Алты","Жети","Сегиз","Тогуз",
      "Он","Он бир","Он эки","Он үч","Он төрт","Он беш","Он алты","Он жети",
      "Он сегиз","Он тогуз","Жыйырма"
    ];
    kg = kgMap[i];
  } else {
    const t = Math.floor(i / 10);
    const o = i % 10;
    kg = tens[t] + (o > 0 ? " " + ones[o] : "");
  }

  return { en: i.toString(), kg };
});